torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723cs/hal/rtl8703b/sdio/sdio_halinit.c
}

/*
 * If variable not handled here,
 * some variables will be processed in GetHwReg8703B()
 */
void GetHwReg8703BS(PADAPTER padapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE pHalData = GET_HAL_DATA(padapter);


	switch (variable) {
	case HW_VAR_CPWM:
		*val = rtw_read8(padapter, SDIO_LOCAL_BASE | SDIO_REG_HCPWM1_8703B);
		break;

	case HW_VAR_FW_PS_STATE: {
		/* 3. read dword 0x88               */ /* driver read fw ps state */
		*((u16 *)val) = rtw_read16(padapter, 0x88);
	}
	break;
	default:
		GetHwReg8703B(padapter, variable, val);
		break;
	}

}

/*
 *	Description:
 *		Query setting of specified variable.
 *   */
u8
GetHalDefVar8703BSDIO(
	IN	PADAPTER				Adapter,
	IN	HAL_DEF_VARIABLE		eVariable,
	IN	PVOID					pValue
)
{
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	case HAL_DEF_IS_SUPPORT_ANT_DIV:
#ifdef CONFIG_ANTENNA_DIVERSITY
		*((u8 *)pValue) = _FALSE;
#endif
		break;

	case HW_VAR_MAX_RX_AMPDU_FACTOR:
		/* Stanley@BB.SD3 suggests 16K can get stable performance */
		/* coding by Lucas@20130730 */
		*(HT_CAP_AMPDU_FACTOR *)pValue = MAX_AMPDU_FACTOR_16K;
		break;
	default:
		bResult = GetHalDefVar8703B(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

/*
 *	Description:
 *		Change default setting of specified variable.
 *   */
u8
SetHalDefVar8703BSDIO(
	IN	PADAPTER				Adapter,
	IN	HAL_DEF_VARIABLE		eVariable,
	IN	PVOID					pValue
)
{
	PHAL_DATA_TYPE	pHalData = GET_HAL_DATA(Adapter);
	u8			bResult = _SUCCESS;

	switch (eVariable) {
	default:
		bResult = SetHalDefVar8703B(Adapter, eVariable, pValue);
		break;
	}

	return bResult;
}

void rtl8703bs_set_hal_ops(PADAPTER padapter)
{
	struct hal_ops *pHalFunc = &padapter->hal_func;


	rtl8703b_set_hal_ops(pHalFunc);

	pHalFunc->hal_power_on = &_InitPowerOn_8703BS;
	pHalFunc->hal_power_off = &CardDisableRTL8703BSdio;


	pHalFunc->hal_init = &rtl8703bs_hal_init;
	pHalFunc->hal_deinit = &rtl8703bs_hal_deinit;

	pHalFunc->init_xmit_priv = &rtl8703bs_init_xmit_priv;
	pHalFunc->free_xmit_priv = &rtl8703bs_free_xmit_priv;

	pHalFunc->init_recv_priv = &rtl8703bs_init_recv_priv;
	pHalFunc->free_recv_priv = &rtl8703bs_free_recv_priv;

	pHalFunc->InitSwLeds = &rtl8703bs_InitSwLeds;
	pHalFunc->DeInitSwLeds = &rtl8703bs_DeInitSwLeds;

	pHalFunc->init_default_value = &rtl8703bs_init_default_value;
	pHalFunc->intf_chip_configure = &rtl8703bs_interface_configure;
	pHalFunc->read_adapter_info = &ReadAdapterInfo8703BS;

	pHalFunc->enable_interrupt = &EnableInterrupt8703BSdio;
	pHalFunc->disable_interrupt = &DisableInterrupt8703BSdio;
	pHalFunc->check_ips_status = &CheckIPSStatus;
#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_WOWLAN)
	pHalFunc->clear_interrupt = &ClearInterrupt8703BSdio;
#endif
	pHalFunc->set_hw_reg_handler = &SetHwReg8703BS;
	pHalFunc->GetHwRegHandler = &GetHwReg8703BS;
	pHalFunc->get_hal_def_var_handler = &GetHalDefVar8703BSDIO;
	pHalFunc->SetHalDefVarHandler = &SetHalDefVar8703BSDIO;

	pHalFunc->hal_xmit = &rtl8703bs_hal_xmit;
	pHalFunc->mgnt_xmit = &rtl8703bs_mgnt_xmit;
	pHalFunc->hal_xmitframe_enqueue = &rtl8703bs_hal_xmitframe_enqueue;

#ifdef CONFIG_HOSTAPD_MLME
	pHalFunc->hostap_mgnt_xmit_entry = NULL;
#endif

#if defined(CONFIG_CHECK_BT_HANG) && defined(CONFIG_BT_COEXIST)
	pHalFunc->hal_init_checkbthang_workqueue = &rtl8703bs_init_checkbthang_workqueue;
	pHalFunc->hal_free_checkbthang_workqueue = &rtl8703bs_free_checkbthang_workqueue;
	pHalFunc->hal_cancle_checkbthang_workqueue = &rtl8703bs_cancle_checkbthang_workqueue;
	pHalFunc->hal_checke_bt_hang = &rtl8703bs_hal_check_bt_hang;
#endif

}
